Model: "SimpleModeLessDense"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Training_Data_Augmentation ( (None, 28, 28, 1)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 27, 27, 64)        320       
_________________________________________________________________
average_pooling2d_1 (Average (None, 13, 13, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 13, 13, 64)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 10816)             0         
_________________________________________________________________
dense_12 (Dense)             (None, 128)               1384576   
_________________________________________________________________
dense_13 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_14 (Dense)             (None, 10)                650       
=================================================================
Total params: 1,393,802
Trainable params: 1,393,802
Non-trainable params: 0
_________________________________________________________________
