Model: "SimpleModel_LessDense_avg"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Training_Data_Augmentation ( (None, 28, 28, 1)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 27, 27, 64)        320       
_________________________________________________________________
average_pooling2d (AveragePo (None, 13, 13, 64)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 13, 13, 64)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 10816)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               1384576   
_________________________________________________________________
dense_10 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_11 (Dense)             (None, 10)                650       
=================================================================
Total params: 1,393,802
Trainable params: 1,393,802
Non-trainable params: 0
_________________________________________________________________
